SpenceKonde/ATTinyCore/avr/boards.txt
#attiny84_12.build.mcu=attiny84
#attiny84_12.build.f_cpu=12000000L
#attiny84_12.build.core=tiny
#attiny84_12.build.variant=tinyX4optiboot
 
###########################################################################
#attiny84.name=Optiboot ATtiny84 @ 8 MHz  (internal osc)

#attiny84.upload.tool=avrdude
#attiny84.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
#attiny84.upload.maximum_size=7616

#attiny84.bootloader.tool=avrdude
#attiny84.bootloader.low_fuses=0xE2
#attiny84.bootloader.high_fuses=0xD7
#attiny84.bootloader.extended_fuses=0xFE
#attiny84.bootloader.path=optiboot
#attiny84.bootloader.file=optiboot_attiny84.hex

#attiny84.build.mcu=attiny84
#attiny84.build.f_cpu=8000000L
#attiny84.build.core=tiny
#attiny84.build.variant=tinyX4optiboot
 
###########################################################################

#attiny84nr.name=Optiboot ATtiny84 @ 8 MHz  (NO RESET!)

#attiny84nr.upload.tool=avrdude
#attiny84nr.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
#attiny84nr.upload.maximum_size=7616

#attiny84nr.bootloader.tool=avrdude
#attiny84nr.bootloader.low_fuses=0xE2
#attiny84nr.bootloader.high_fuses=0x57
#attiny84nr.bootloader.extended_fuses=0xFE
#attiny84nr.bootloader.path=optiboot
#attiny84nr.bootloader.file=optiboot_attiny84.hex

#attiny84nr.build.mcu=attiny84
#attiny84nr.build.f_cpu=8000000L
#attiny84nr.build.core=tiny
#attiny84nr.build.variant=tinyX4optiboot
 
###########################################################################

#attiny85.name=Optiboot ATtiny85 @ 8 MHz  (internal osc)

#attiny85.upload.tool=avrdude
#attiny85.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
#attiny85.upload.maximum_size=7616

#attiny85.bootloader.tool=avrdude
#attiny85.bootloader.low_fuses=0xE2
#attiny85.bootloader.high_fuses=0xD7
#attiny85.bootloader.extended_fuses=0xFE
#attiny85.bootloader.path=optiboot
#attiny85.bootloader.file=optiboot_attiny85.hex#

#attiny85.build.mcu=attiny85
#attiny85.build.f_cpu=8000000L
#attiny85.build.core=tiny
#attiny85.build.variant=tinyX5optiboot



